# SpatialElementBoundaryOptions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElementBoundaryOptions Class
Members See Also
---
Options that can be passed to a SpatialElementBoundaryCalculator to influence the results of the calculation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class SpatialElementBoundaryOptions : IDisposable
```

Visual Basic
---
```text
Public Class SpatialElementBoundaryOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class SpatialElementBoundaryOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..SpatialElementBoundaryOptions
# See Also
SpatialElementBoundaryOptions Members
Autodesk.Revit.DB Namespace